[{"title": "\nRising agri demand forces power curbs on industrial units in Punjab  | Other States, 18:00\n", "link": "https://www.thehindu.com/news/national/other-states/rising-agri-demand-forces-power-curbs-on-industrial-units-in-punjab/article35169682.ece", "data": {"content": "Manufacturers slam three-day closures in amid pandemic slowdown.\n\nAs Punjab continues to struggle with severe power shortage, the Punjab State Power Corporation Limited (PSPCL) has yet again imposed curbs on industrial consumers, directing the general industry to observe three days off till July 10.\n\nThe PSPCL in its latest order said that in view of the prolonged dry spell and increase in demand of power from agriculture sector, it has been decided to impose power regulatory measures on industrial consumers, except essential industries and services of west, north and central zones.\n\nThe power regulatory measure includes three weekly-off days for general industry (large scale), rolling mills, arc and induction furnaces consumers from July 7 till July 10.\n\nResponding to the announcement, Badish Jindal, president of the Federation of Punjab Small Industries Association said that the industry — be it the large, medium or the small scale — already had been facing financial stress due to COVID-19 pandemic, and now the unscheduled cuts and shutdowns have only aggravated the problem.\n\n“The industry is shut but yet we have to pay salaries to the workers. We are paying the interest on loans etc. to banks, exports orders are being cancelled... Due to the shutdown several industry sectors are not in a position to deliver the orders within the stipulated time to buyers, hence the buyers are not just cancelling the order but also imposing penalties,” he told The Hindu.\n\n“Every year the demand for power rises during the paddy sowing season, which is not something new. Even credible weather forecast mechanism is available, yet we are facing such situation, which is unfortunate,” said Mr. Jindal.\n\nPunjab’s average electricity demand during the ongoing paddy season has been more than 14,500 MW, against average supply of 13,500 MW. The PSPCL on July 5 in a statement stated that on average 10.3 hours of electricity across the State was supplied for paddy operations.", "authors": ["One Got The Certificate Saying She Was Fully Vaccinated Even Though She Did Not Receive Her Second Dose", "Another Received A Provisional Certificate For Her First Dose Without Even Getting A Jab", "A Video Feature On The Residents Of Balkote", "Silikote In The Wake Of The India-Pakistan Ceasefire"], "publish_date": null, "keywords": ["power", "curbs", "rising", "pspcl", "average", "punjab", "demand", "units", "industrial", "forces", "till", "agri", "paddy", "industry", "consumers", "state"]}}, {"title": "\nTension in Bengal district after man dies in police custody; two policemen suspended  | Kolkata, 17:59\n", "link": "https://www.thehindu.com/news/cities/kolkata/tension-in-bengal-district-after-man-dies-in-police-custody-two-policemen-suspended/article35169637.ece", "data": {"content": "A 21-year-old man died in police custody in Bengal’s Paschim Bardhaman district on July 6 morning, triggering tension in the area, as locals hurled stones at the outpost, where he was held, and torched several vehicles stationed outside, a senior officer said.\n\nA complaint was lodged by the father of the deceased, following which the two police officers, who had arrested him on July 5 night for his involvement in a theft case, were suspended, he said.\n\n“The health condition of the accused deteriorated in custody. He was declared dead when taken to a nearby hospital,” the senior police officer said.\n\nA huge police team, which was rushed to Barakar area to control the situation during the day, used teargas to disperse the mob that attacked the outpost.\n\n“Nobody was injured in the melee. We have suspended two police officers who were handling the case. The situation is under control at the moment,” the officer added.", "authors": ["Government", "Private Offices Can Function With Not More Than", "Of Strength"], "publish_date": null, "keywords": ["dies", "custody", "district", "saida", "policemen", "man", "control", "area", "bengal", "senior", "suspended", "officers", "tension", "officer", "situation", "case"]}}]