[{"title": "\n‘New-School Sweets...’, co-authored by pastry chef and educator Vinesh Johny, helps baking enthusiasts up their skills  | Food, 16:21\n", "link": "https://www.thehindu.com/life-and-style/food/new-school-sweets-book-chef-vinesh-johny-for-baking-enthusiasts/article35146843.ece", "data": {"content": "Innovative recipes meet old favourites in the book that is filled with just desserts\n\n“A good dessert has to be packed with flavours and textures. Whatever I make, the balance of cream to sponge and to crunch is extremely important. Every bite must be unique and not a mindless consumption of sugar,” says Pastry Chef Vinesh Johny, co-founder of Bengaluru-based Lavonne Academy of Baking Science & Pastry Arts.\n\nThis conviction is evident in his cookbook New-School Sweets: Old-School Pastries with an Insanely Delicious Twist, which the pastry chef and educator has authored with his friend Andres Lara, a Colombian chef based in the US. Vinesh met Andres during a vacation in Japan and the two bonded over their “philosophy towards desserts”.\n\nThe dessert philosophy\n\nA philosophy for desserts? “Yes,” says Vinesh. He continues: “Lots of modern techniques have been introduced into traditional bakes. We believe that when we consume a dessert, it has to be super delicious. It has to be something you can enjoy wholeheartedly with a smile. Made with flavours that you are familiar with but laced with surprises,” he says over a phone call from Bengaluru.\n\nPastry chefs Vinesh Johny and Andrés Lara | Photo Credit: Special arrangement\n\nThe chefs have drawn on their years of experience and understanding of ingredients to formulate recipes that enhance the experience of having a dessert, even familiar ones like the lemon cake. “We try to ensure that you get the maximum impact from eating a lemon cake by making it the juiciest, most flavoursome and moist cake ever. That is how we formulate the recipes,” he says.\n\nVinesh says they had always talked about how it would be if they were to open a café. “The book has seven chapters that are devoted to what you want to find in a modern café today, from layered cakes to cookies,” he says. Divided into seven sections such as ‘Dramatic pies and tarts’, ‘Next-level travel cakes’, ‘Yum-yum cookies’, ‘Midnight layer cakes’, ‘Scrumptious snacks’, ‘Glorious breakfast bakes’ and ‘Shop style desserts’, the cookbook has clear instructions for each dessert. Each recipe is preceded by an interesting note with a personal touch.\n\n“So many times, as teenagers, when we found ourselves suddenly hungry in the middle of the night, we’d go into the kitchen and gather all the tasty ingredients we could find, and roll it into one crazy package of flavours….” So goes the introductory note for a decadent Chocolate banana caramel snack.\n\nSaumya Thomas, a baking enthusiast, says that she enjoys the book as the ingredients are easily available and the methods doable. “So, in a layered cake, I can easily leave out one layer and my dessert will still be an interesting one and a treat for the taste buds.”\n\nThere are recipes that reimagine old favourites with the addition of an ingredient or two and innovative ones combining two desserts, thus imbuing new flavours and textures.\n\nPeanut passion choux, a recipe formulated by pastry chefs Vinesh Johny and Andrés Lara for their new cookbook ‘New-School Sweets: Old-School Pastries with an Insanely Delicious Twist’ | Photo Credit: Special arrangement\n\n“Although there is nothing complicated about the recipes or the ingredients, this is not meant for beginners. New-School Sweets… is for baking enthusiasts who have been trying their hand at various bakes. It would challenge a baker to think more creatively, to think of unique combinations that are simple but exceptional,” says Vinesh.\n\nThe cookbook was two years in the making and has been inspired by the travels of the authors, what they enjoy in desserts, and how they would interpret it in a book.\n\nWhile talking about Taiwanese pineapple tart, cheesecake pie, saffron brioche and a Tahini banana loaf as examples of recipes inspired by their travel, he stops at choosing a favourite among the more than 70 recipes in the book.“That’s a really tough one. While writing the book, there were certain desserts we could not stop eating. Chocolate and cream cookie, for instance. It is cookie at the bottom and cream on top and extremely tasty,” he says.\n\nHome baking is in\n\nFeatured among the ‘Forbes 30 under 30’ Asia list for 2016 in the Arts category, Vinesh says he is excited to see how the industry has progressed and how home baking has touched a new high as a result of cookery shows, food shows and YouTube videos on cookery.\n\nGulab Jamun Tart by pastry chefs Vinesh Johny and Andrés Lara | Photo Credit: Special arrangement\n\n“Most of us enjoy eating. That sort of importance for food has challenged chefs to constantly innovate, even with something simple. We have been a school for ten years now. We can see how much the industry has come forward in the number of students inquisitive about pastry. The lockdown has seen many people baking at home and enjoying it,” explains Vinesh.\n\nHe asserts that with many bakers planning to become entrepreneurs, the baking scene in India is poised for a huge change. “Many home bakers are already making a name with a few bakes and desserts they have perfected. That would motivate them to start their own venture. But to make it a sustainable and viable business, some amount of investment should go in; I would suggest that bakers invest time in learning it the right way. As much as the recipes are right there on YouTube, you have to understand the nuances of it to run a business. Only then will there be a vision to making the business successful.”", "authors": ["Rohan Matmary", "India Winner Of Diageo Reserve World Class Discusses The Ingredient", "His Preparation For Global Finals"], "publish_date": null, "keywords": ["pastry", "vinesh", "skills", "helps", "sweets", "educator", "baking", "johny", "chefs", "making", "dessert", "newschool", "recipes", "lara", "coauthored", "desserts", "enthusiasts"]}}]